views/paper-type/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'paper_id')->dropDownList(
		ArrayHelper::map(Paper::find()->where(['status'=>1])->all(),'paper_id','name'),
		['prompt'=>'select ',
        'style'=>'width:50%;']
	) ?>

    <?= $form->field($model, 'type_id')->dropDownList(
		ArrayHelper::map(Type::find()->where(['status'=>1])->all(),'type_id','name'),
		['prompt'=>'select ',
        'style'=>'width:50%;']
	) ?>
---
SELECT * FROM `paper` WHERE `status`=1
SELECT * FROM `type` WHERE `status`=1