controllers/AcademicYearController.php

    protected function findModel($id)
    {
        if (($model = AcademicYear::findOne($id)) !== null) {
---
SELECT * FROM `academic_year` WHERE `academic_year_id`='1'