controllers/AppointmentController.php

    protected function findModel($id)
    {
        if (($model = Appointment::findOne($id)) !== null) {
---
SELECT * FROM `appointment` WHERE `appointment_id`='5'