controllers/AuditingMemberController.php

SELECT * FROM `auditing_member` WHERE `auditing_member_id`='1'
---
    protected function findModel($id)
    {
        if (($model = AuditingMember::findOne($id)) !== null) {