controllers/DepartmentController.php

    protected function findModel($id)
    {
        if (($model = Department::findOne($id)) !== null) {
---
SELECT * FROM `department` WHERE `department_id`='1'