controllers/EventController.php

    protected function findModel($id)
    {
        if (($model = Event::findOne($id)) !== null) {
---
SELECT * FROM `event` WHERE `event_id`='1'