controllers/PaperController.php

    public function actionDelete($id)
    {
        if(!Yii::$app->user->isGuest){
            $model =Paper::findOne($id);
---
SELECT * FROM `paper` WHERE `paper_id`='1'

    protected function findModel($id)
    {
        if (($model = Paper::findOne($id)) !== null) {
---
SELECT * FROM `paper` WHERE `paper_id`='4'