controllers/PaperTypeController.php

    protected function findModel($id)
    {
        if (($model = PaperType::findOne($id)) !== null) {
---
SELECT * FROM `paper_type` WHERE `paper_type_id`='7'