controllers/ProgramController.php

SELECT * FROM `program` WHERE `program_id`='1'
---
    protected function findModel($id)
    {
        if (($model = Program::findOne($id)) !== null) {