controllers/StudentOrganizationController.php

SELECT * FROM `student_organization` WHERE `student_organization_id`='2'
---
    protected function findModel($id)
    {
        if (($model = StudentOrganization::findOne($id)) !== null) {