controllers/StudentController.php

SELECT * FROM `student` WHERE `student_id`='2'
---
    protected function findModel($id)
    {
        if (($model = Student::findOne($id)) !== null) {