views/revision/_form.php

]);?>


	<?=$form->field($model,'paper_id')->dropDownList(
		ArrayHelper::map(Paper::find()->where(['status'=>1])->all(),'paper_id','name'),
		['prompt'=>'select']
)?>


		<?=$form->field($model,'academic_year_id')->dropDownList(
		ArrayHelper::map(AcademicYear::find()->all(),'academic_year_id','year'),
		['prompt'=>'select']
)?>
---
SELECT * FROM `paper` WHERE `status`=1
SELECT * FROM `academic_year`