views/program-student/_form.php

SELECT * FROM `program` WHERE `status`=1
SELECT * FROM `student` WHERE `status`=1
SELECT * FROM `academic_year` ORDER BY `year` DESC
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'program_id')->dropDownList(
        ArrayHelper::map(Program::find()->where(['status' => 1])->all(),'program_id','name'),
        ['prompt'=>'select ']
    ) ?>

    <?= $form->field($model, 'student_id')->dropDownList(
        ArrayHelper::map(Student::find()->where(['status' => 1])->all(),'student_id','name'),
        ['prompt'=>'select ']
    ) ?>

    <?= $form->field($model, 'academic_year_id')->dropDownList(
        ArrayHelper::map(AcademicYear::find()->all(),'academic_year_id','year'),
        ['prompt'=>'select ']
    ) ?>