views/appointment/_form.php

SELECT * FROM `faculty` WHERE `status`=1
---
<div class="appointment-form">

    <?php $form = ActiveForm::begin(); ?>
    <?= $form->field($model, 'faculty_id')->dropDownList(
        ArrayHelper::map(Faculty::find()->where(['status'=>1])->all(),'faculty_id','name'),
        ['prompt'=>'select ']
    )?>